namespace MyMvcApp.Models
{

    public enum TestDifficualtyEnum
    {
        SuperEasy = 1, // Це тест який буде мати всі запитання з одною відповідю.
        Easy = 3, // Це тест який буде мати в собі питання які мають декілька відповідей (не всі).
        Normal = 5, // Це тест який буде мати 50 відсотківв тести, 20 відсотків відповіді (чекбокси), 30 практика.
        Hard = 10, // Це тест який буде мати 60-70 відсотків практики та 40-30 відсотків іменно чекбоксів.
        SuperHard = 25, // Це тест який буде мати 100 відсотків практики і буде таймер (за визначений час вчителем при створенні тесту). (за кожнем певний потрачений час знімається певна кількість очків. напрк 10 відсотків від таймеру)
    }
}
